# [3] CSV to SQL Part 2 - US Census Data

---
The Lending Club dataset contains a feature for the zip code of the borrower. Therefore, it would be interesting to try to map macroeconomic factors to the loan data by using the zip code. This might reveal whether borrowers from less affluent areas are more likely or not to default than those in more affluent areas and whether this has any predictive power for loan defaults.

I have obtained data from the American Community Survey, a survey by the US Census Bureau. The data lists median household income per ZCTA. ZCTA's, or ZIP Code Tabulation Areas, are generalised area representations of the United States Postal Service ZIP code areas. The ZCTA's were created by the US Census Bureau to generalise the area for each US zip code and allow the Bureau to perform summary statistics for each area.

I have downloaded 6 csv files corresponding to median household income per ZCTA for the years 2011, 2012, 2013, 2014, 2015, and 2016. I will load the files into pandas and then push them into the same local PostgreSQL database that I have used for the Lending Club data. After that, I can map the median household income data to the loan data by mapping the ZCTA to the zip code of the borrower.

It should be noted that there are a few potential limitations with this approach. Because I only have income data for 6 years, rather than the full 10 years that the loan data covers, I will have to calculate the average of the incomes to get the mean median household income for the period of 2011 to 2016. This will give me a more generalised measure of the income for a ZCTA. The other limitation is that the Lending Club data only lists the first three digits of the borrowers' zip codes. This could end up being a very large area containing both high and low income ZCTA's. I will have to group the ZCTA's by their first three digits which will further generalise the median household income. It is possible that this could prevent any distinction between low and high income areas. Therefore, it is possible that it will be too generalised to have any predictive power, if it had any at all, but it will be interesting to investigate nonetheless.

---

In [1]:
import pandas as pd
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:database@localhost:5432/Capstone') # Connection to my local SQL database.

## 2011

---
The first file contains median household income per ZCTA for the year 2011. I will load it into pandas and then push it into my local postgreSQL database.

---

In [2]:
file1 = './Datasets/US Census/2011/ACS_11_5YR_S1901_with_ann.csv'   # The path for the csv file.

In [3]:
df1 = pd.read_csv(file1)
df1.head()

,GEO.id,GEO.id2,GEO.display-label,HC01_EST_VC13
0,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,13318
2,8600000US00602,00602,ZCTA5 00602,14947
3,8600000US00603,00603,ZCTA5 00603,14437
4,8600000US00606,00606,ZCTA5 00606,11155

---
The first row contains the column names. Therefore, I will use these as the column names and then drop this row.

---

In [4]:
df1.tail()

               GEO.id GEO.id2 GEO.display-label HC01_EST_VC13
33116  8600000US99923   99923       ZCTA5 99923         27500
33117  8600000US99925   99925       ZCTA5 99925         43125
33118  8600000US99926   99926       ZCTA5 99926         45216
33119  8600000US99927   99927       ZCTA5 99927         17639
33120  8600000US99929   99929       ZCTA5 99929         50286

In [5]:
df1.shape

(33121, 4)

---
There are only just over 33,000 zip codes in the United States. Given the size of the country, these zip code areas will cover quite a large geographical area.

---

In [6]:
df1.columns = df1.iloc[0]    # Rename columns to first row values.

In [7]:
df1.drop(df1.index[0], inplace=True)    # Now drop the first row.

In [8]:
df1.head(2)

,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,13318
2,8600000US00602,00602,ZCTA5 00602,14947

In [9]:
df1.columns = ['id', 'id2', 'zip', 'income_2011']      # I will rename the columns again for ease of use.

In [10]:
df1.head(2)

               id    id2          zip income_2011
1  8600000US00601  00601  ZCTA5 00601       13318
2  8600000US00602  00602  ZCTA5 00602       14947

In [11]:
df1.to_sql(name='US_Census_2011', con=engine, if_exists='replace', index = False)
# Push the file to my local database.

In [12]:
# Read in the new table from SQL to test.
SQL_STRING = '''

select * from "US_Census_2011"
'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

               id    id2          zip income_2011
0  8600000US00601  00601  ZCTA5 00601       13318
1  8600000US00602  00602  ZCTA5 00602       14947
2  8600000US00603  00603  ZCTA5 00603       14437
3  8600000US00606  00606  ZCTA5 00606       11155
4  8600000US00610  00610  ZCTA5 00610       16367

## 2012

---
Now that I have pushed the 2011 data into SQL, I will now repeat this process for the years 2012 to 2016.

---

In [13]:
file2 = './Datasets/US Census/2012/ACS_12_5YR_S1901_with_ann.csv'

In [14]:
df2 = pd.read_csv(file2)
df2.head()

,GEO.id,GEO.id2,GEO.display-label,HC01_EST_VC13
0,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,13495
2,8600000US00602,00602,ZCTA5 00602,15106
3,8600000US00603,00603,ZCTA5 00603,15079
4,8600000US00606,00606,ZCTA5 00606,12098

In [15]:
df2.tail()

               GEO.id GEO.id2 GEO.display-label HC01_EST_VC13
33116  8600000US99923   99923       ZCTA5 99923         19107
33117  8600000US99925   99925       ZCTA5 99925         48750
33118  8600000US99926   99926       ZCTA5 99926         48448
33119  8600000US99927   99927       ZCTA5 99927         19107
33120  8600000US99929   99929       ZCTA5 99929         47386

In [16]:
df2.shape

(33121, 4)

In [17]:
df2.columns = df2.iloc[0]

In [18]:
df2.drop(df2.index[0], inplace=True)

In [19]:
df2.head(2)

,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,13495
2,8600000US00602,00602,ZCTA5 00602,15106

In [20]:
df2.columns = ['id', 'id2', 'zip', 'income_2012']

In [21]:
df2.head(2)

               id    id2          zip income_2012
1  8600000US00601  00601  ZCTA5 00601       13495
2  8600000US00602  00602  ZCTA5 00602       15106

In [22]:
df2.to_sql(name='US_Census_2012', con=engine, if_exists='replace', index = False)

In [23]:
SQL_STRING = '''

select * from "US_Census_2012"
'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

               id    id2          zip income_2012
0  8600000US00601  00601  ZCTA5 00601       13495
1  8600000US00602  00602  ZCTA5 00602       15106
2  8600000US00603  00603  ZCTA5 00603       15079
3  8600000US00606  00606  ZCTA5 00606       12098
4  8600000US00610  00610  ZCTA5 00610       16923

## 2013

In [24]:
file3 = './Datasets/US Census/2013/ACS_13_5YR_S1901_with_ann.csv'

In [25]:
df3 = pd.read_csv(file3)
df3.head()

,GEO.id,GEO.id2,GEO.display-label,HC01_EST_VC13
0,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,12041
2,8600000US00602,00602,ZCTA5 00602,15663
3,8600000US00603,00603,ZCTA5 00603,15485
4,8600000US00606,00606,ZCTA5 00606,15019

In [26]:
df3.tail()

               GEO.id GEO.id2 GEO.display-label HC01_EST_VC13
33116  8600000US99923   99923       ZCTA5 99923         21944
33117  8600000US99925   99925       ZCTA5 99925         38125
33118  8600000US99926   99926       ZCTA5 99926         50052
33119  8600000US99927   99927       ZCTA5 99927         19000
33120  8600000US99929   99929       ZCTA5 99929         45649

In [27]:
df3.shape

(33121, 4)

In [28]:
df3.columns = df3.iloc[0]

In [29]:
df3.drop(df3.index[0], inplace=True)

In [30]:
df3.head(2)

,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,12041
2,8600000US00602,00602,ZCTA5 00602,15663

In [31]:
df3.columns = ['id', 'id2', 'zip', 'income_2013']

In [32]:
df3.head(2)

               id    id2          zip income_2013
1  8600000US00601  00601  ZCTA5 00601       12041
2  8600000US00602  00602  ZCTA5 00602       15663

In [33]:
df3.to_sql(name='US_Census_2013', con=engine, if_exists='replace', index = False)

In [34]:
SQL_STRING = '''

select * from "US_Census_2013"
'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

               id    id2          zip income_2013
0  8600000US00601  00601  ZCTA5 00601       12041
1  8600000US00602  00602  ZCTA5 00602       15663
2  8600000US00603  00603  ZCTA5 00603       15485
3  8600000US00606  00606  ZCTA5 00606       15019
4  8600000US00610  00610  ZCTA5 00610       16707

## 2014

In [35]:
file4 = './Datasets/US Census/2014/ACS_14_5YR_S1901_with_ann.csv'

In [36]:
df4 = pd.read_csv(file4)
df4.head()

,GEO.id,GEO.id2,GEO.display-label,HC01_EST_VC13
0,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,10833
2,8600000US00602,00602,ZCTA5 00602,16353
3,8600000US00603,00603,ZCTA5 00603,16323
4,8600000US00606,00606,ZCTA5 00606,14138

In [37]:
df4.tail()

               GEO.id GEO.id2 GEO.display-label HC01_EST_VC13
33116  8600000US99923   99923       ZCTA5 99923             -
33117  8600000US99925   99925       ZCTA5 99925         39167
33118  8600000US99926   99926       ZCTA5 99926         51071
33119  8600000US99927   99927       ZCTA5 99927         17946
33120  8600000US99929   99929       ZCTA5 99929         48153

In [38]:
df4.shape

(33121, 4)

In [39]:
df4.columns = df4.iloc[0]

In [40]:
df4.drop(df4.index[0], inplace=True)

In [41]:
df4.head(2)

,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,10833
2,8600000US00602,00602,ZCTA5 00602,16353

In [42]:
df4.columns = ['id', 'id2', 'zip', 'income_2014']

In [43]:
df4.head(2)

               id    id2          zip income_2014
1  8600000US00601  00601  ZCTA5 00601       10833
2  8600000US00602  00602  ZCTA5 00602       16353

In [44]:
df4.to_sql(name='US_Census_2014', con=engine, if_exists='replace', index = False)

In [45]:
SQL_STRING = '''

select * from "US_Census_2014"
'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

               id    id2          zip income_2014
0  8600000US00601  00601  ZCTA5 00601       10833
1  8600000US00602  00602  ZCTA5 00602       16353
2  8600000US00603  00603  ZCTA5 00603       16323
3  8600000US00606  00606  ZCTA5 00606       14138
4  8600000US00610  00610  ZCTA5 00610       17265

## 2015

In [46]:
file5 = './Datasets/US Census/2015/ACS_15_5YR_S1901_with_ann.csv'

In [47]:
df5 = pd.read_csv(file5)
df5.head()

,GEO.id,GEO.id2,GEO.display-label,HC01_EST_VC13
0,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,10816
2,8600000US00602,00602,ZCTA5 00602,16079
3,8600000US00603,00603,ZCTA5 00603,16804
4,8600000US00606,00606,ZCTA5 00606,12512

In [48]:
df5.tail()

               GEO.id GEO.id2 GEO.display-label HC01_EST_VC13
33116  8600000US99923   99923       ZCTA5 99923             -
33117  8600000US99925   99925       ZCTA5 99925         38594
33118  8600000US99926   99926       ZCTA5 99926         51071
33119  8600000US99927   99927       ZCTA5 99927         19861
33120  8600000US99929   99929       ZCTA5 99929         47941

In [49]:
df5.shape

(33121, 4)

In [50]:
df5.columns = df5.iloc[0]

In [51]:
df5.drop(df5.index[0], inplace=True)

In [52]:
df5.head(2)

,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,10816
2,8600000US00602,00602,ZCTA5 00602,16079

In [53]:
df5.columns = ['id', 'id2', 'zip', 'income_2015']

In [54]:
df5.head(2)

               id    id2          zip income_2015
1  8600000US00601  00601  ZCTA5 00601       10816
2  8600000US00602  00602  ZCTA5 00602       16079

In [55]:
df5.to_sql(name='US_Census_2015', con=engine, if_exists='replace', index = False)

In [56]:
SQL_STRING = '''

select * from "US_Census_2015"
'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

               id    id2          zip income_2015
0  8600000US00601  00601  ZCTA5 00601       10816
1  8600000US00602  00602  ZCTA5 00602       16079
2  8600000US00603  00603  ZCTA5 00603       16804
3  8600000US00606  00606  ZCTA5 00606       12512
4  8600000US00610  00610  ZCTA5 00610       17475

## 2016

In [57]:
file6 = './Datasets/US Census/2016/ACS_16_5YR_S1901_with_ann.csv'

In [58]:
df6 = pd.read_csv(file2)
df6.head()

,GEO.id,GEO.id2,GEO.display-label,HC01_EST_VC13
0,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,13495
2,8600000US00602,00602,ZCTA5 00602,15106
3,8600000US00603,00603,ZCTA5 00603,15079
4,8600000US00606,00606,ZCTA5 00606,12098

In [59]:
df6.tail()

               GEO.id GEO.id2 GEO.display-label HC01_EST_VC13
33116  8600000US99923   99923       ZCTA5 99923         19107
33117  8600000US99925   99925       ZCTA5 99925         48750
33118  8600000US99926   99926       ZCTA5 99926         48448
33119  8600000US99927   99927       ZCTA5 99927         19107
33120  8600000US99929   99929       ZCTA5 99929         47386

In [60]:
df6.shape

(33121, 4)

In [61]:
df6.columns = df6.iloc[0]

In [62]:
df6.drop(df6.index[0], inplace=True)

In [63]:
df6.head(2)

,Id,Id2,Geography,Households; Estimate; Median income (dollars)
1,8600000US00601,00601,ZCTA5 00601,13495
2,8600000US00602,00602,ZCTA5 00602,15106

In [64]:
df6.columns = ['id', 'id2', 'zip', 'income_2016']

In [65]:
df6.head(2)

               id    id2          zip income_2016
1  8600000US00601  00601  ZCTA5 00601       13495
2  8600000US00602  00602  ZCTA5 00602       15106

In [66]:
df6.to_sql(name='US_Census_2016', con=engine, if_exists='replace', index = False)

In [67]:
SQL_STRING = '''

select * from "US_Census_2016"
'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

               id    id2          zip income_2016
0  8600000US00601  00601  ZCTA5 00601       13495
1  8600000US00602  00602  ZCTA5 00602       15106
2  8600000US00603  00603  ZCTA5 00603       15079
3  8600000US00606  00606  ZCTA5 00606       12098
4  8600000US00610  00610  ZCTA5 00610       16923

## Concatonation

---
I have pushed all six files into SQL. Now I need to calculate the average median household income for each ZCTA. To facilitate averaging the household median income, I will read in income data from all six years into one dataframe. I will then be able to calculate the mean of the income columns for each ZCTA.

---

In [68]:
# Read in income data from all years into a single dataframe.
SQL_STRING = '''

select c11.zip, c11.income_2011, c12.income_2012, c13.income_2013, c14.income_2014, c15.income_2015, c16.income_2016
from "US_Census_2011" c11
inner join "US_Census_2012" c12 on c11.zip = c12.zip
inner join "US_Census_2013" c13 on c11.zip = c13.zip
inner join "US_Census_2014" c14 on c11.zip = c14.zip
inner join "US_Census_2015" c15 on c11.zip = c15.zip
inner join "US_Census_2016" c16 on c11.zip = c16.zip


'''

df = pd.read_sql(SQL_STRING, con=engine)
df.head()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016
0,ZCTA5 00602,14947,15106,15663,16353,16079,15106
1,ZCTA5 00610,16367,16923,16707,17265,17475,16923
2,ZCTA5 00622,11871,12059,14281,14993,15689,12059
3,ZCTA5 00623,16163,16447,17389,17044,16593,16447
4,ZCTA5 00624,14475,15500,14768,15467,15573,15500

In [69]:
df.shape

(33120, 7)

In [70]:
df.dtypes

zip            object
income_2011    object
income_2012    object
income_2013    object
income_2014    object
income_2015    object
income_2016    object
dtype: object

---
Having checked the dtypes of the income columns, they are object type rather than numeric (int or float). I will convert these to numeric type.

---

In [71]:
df[['income_2011', 'income_2012',
    'income_2013', 'income_2014',
    'income_2015', 'income_2016']] = df[['income_2011', 'income_2012',
                                         'income_2013', 'income_2014',
                                         'income_2015', 'income_2016']].apply(pd.to_numeric, errors='coerce')
# Convert income columns to numeric.

---
Now that they are numeric, I can create a new column to take the mean of the median household income.

---

In [72]:
# Create new column for mean of income columns.
df['mean_median_household_income'] = df[['income_2011', 'income_2012', 'income_2013', 'income_2014',
                                       'income_2015', 'income_2016']].mean(axis=1)
df.head()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,mean_median_household_income
0,ZCTA5 00602,14947.0,15106.0,15663.0,16353.0,16079.0,15106.0,15542.333333
1,ZCTA5 00610,16367.0,16923.0,16707.0,17265.0,17475.0,16923.0,16943.333333
2,ZCTA5 00622,11871.0,12059.0,14281.0,14993.0,15689.0,12059.0,13492.000000
3,ZCTA5 00623,16163.0,16447.0,17389.0,17044.0,16593.0,16447.0,16680.500000
4,ZCTA5 00624,14475.0,15500.0,14768.0,15467.0,15573.0,15500.0,15213.833333

In [73]:
df.tail()

,zip,income_2011,income_2012,income_2013,income_2014,income_2015,income_2016,mean_median_household_income
33115,ZCTA5 99836,75500.0,56667.0,56250.0,56250.0,82813.0,56667.0,64024.500000
33116,ZCTA5 99840,73000.0,71583.0,71667.0,72868.0,69318.0,71583.0,71669.833333
33117,ZCTA5 99841,46875.0,49167.0,62813.0,70625.0,54375.0,49167.0,55503.666667
33118,ZCTA5 99921,54271.0,50875.0,54554.0,57083.0,61908.0,50875.0,54927.666667
33119,ZCTA5 99927,17639.0,19107.0,19000.0,17946.0,19861.0,19107.0,18776.666667

---
With the mean median household income for each ZCTA calculated, I will push this to a new SQL table.

---

In [74]:
df.to_sql(name='all_incomes', con=engine, if_exists='replace', index = False)